Ran Plan for dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
mise WARN  No untrusted config files found.

05:19:10.174 WARN   Config ../vpc/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
05:19:10.176 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/lb_LJliwtGTCEJdstjxUDsYySVE/ma2kK_qqD0KAthqnsyBtZabhBww
05:19:10.219 INFO   tofu: Initializing the backend...
05:19:10.404 INFO   tofu: 
05:19:10.404 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:19:10.404 INFO   tofu: use this backend unless the backend configuration changes.
05:19:10.581 INFO   tofu: Initializing provider plugins...
05:19:10.581 INFO   tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
05:19:13.331 INFO   tofu: - Installing hashicorp/aws v6.31.0 to the shared cache directory...
05:19:47.685 INFO   tofu: - Installed hashicorp/aws v6.31.0 (signed, key ID 0C0AF313E5FD9F80)
05:19:47.688 INFO   tofu: - Using hashicorp/aws v6.31.0 from the shared cache directory
05:19:47.688 INFO   tofu: Providers are signed by their developers.
05:19:47.688 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:19:47.688 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:19:47.688 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
05:19:47.688 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
05:19:47.689 INFO   tofu: version control system if they represent changes you intended to make.
05:19:47.691 INFO   tofu: OpenTofu has been successfully initialized!
05:19:49.539 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:19:49.539 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:19:49.539 STDOUT tofu:   + create
05:19:49.539 STDOUT tofu: OpenTofu will perform the following actions:
05:19:49.539 STDOUT tofu:   # aws_instance.web will be created
05:19:49.539 STDOUT tofu:   + resource "aws_instance" "web" {
05:19:49.539 STDOUT tofu:       + ami                                  = "ami-0092e0c93f74c293a"
05:19:49.539 STDOUT tofu:       + arn                                  = (known after apply)
05:19:49.539 STDOUT tofu:       + associate_public_ip_address          = (known after apply)
05:19:49.539 STDOUT tofu:       + availability_zone                    = (known after apply)
05:19:49.539 STDOUT tofu:       + disable_api_stop                     = (known after apply)
05:19:49.539 STDOUT tofu:       + disable_api_termination              = (known after apply)
05:19:49.539 STDOUT tofu:       + ebs_optimized                        = (known after apply)
05:19:49.539 STDOUT tofu:       + enable_primary_ipv6                  = (known after apply)
05:19:49.539 STDOUT tofu:       + force_destroy                        = false
05:19:49.539 STDOUT tofu:       + get_password_data                    = false
05:19:49.539 STDOUT tofu:       + host_id                              = (known after apply)
05:19:49.539 STDOUT tofu:       + host_resource_group_arn              = (known after apply)
05:19:49.539 STDOUT tofu:       + iam_instance_profile                 = (known after apply)
05:19:49.539 STDOUT tofu:       + id                                   = (known after apply)
05:19:49.539 STDOUT tofu:       + instance_initiated_shutdown_behavior = (known after apply)
05:19:49.539 STDOUT tofu:       + instance_lifecycle                   = (known after apply)
05:19:49.539 STDOUT tofu:       + instance_state                       = (known after apply)
05:19:49.539 STDOUT tofu:       + instance_type                        = "t3.micro"
05:19:49.539 STDOUT tofu:       + ipv6_address_count                   = (known after apply)
05:19:49.540 STDOUT tofu:       + ipv6_addresses                       = (known after apply)
05:19:49.540 STDOUT tofu:       + key_name                             = (known after apply)
05:19:49.540 STDOUT tofu:       + monitoring                           = (known after apply)
05:19:49.540 STDOUT tofu:       + outpost_arn                          = (known after apply)
05:19:49.540 STDOUT tofu:       + password_data                        = (known after apply)
05:19:49.540 STDOUT tofu:       + placement_group                      = (known after apply)
05:19:49.540 STDOUT tofu:       + placement_group_id                   = (known after apply)
05:19:49.540 STDOUT tofu:       + placement_partition_number           = (known after apply)
05:19:49.540 STDOUT tofu:       + primary_network_interface_id         = (known after apply)
05:19:49.540 STDOUT tofu:       + private_dns                          = (known after apply)
05:19:49.540 STDOUT tofu:       + private_ip                           = (known after apply)
05:19:49.540 STDOUT tofu:       + public_dns                           = (known after apply)
05:19:49.540 STDOUT tofu:       + public_ip                            = (known after apply)
05:19:49.540 STDOUT tofu:       + region                               = "ap-northeast-2"
05:19:49.540 STDOUT tofu:       + secondary_private_ips                = (known after apply)
05:19:49.540 STDOUT tofu:       + security_groups                      = (known after apply)
05:19:49.540 STDOUT tofu:       + source_dest_check                    = true
05:19:49.540 STDOUT tofu:       + spot_instance_request_id             = (known after apply)
05:19:49.540 STDOUT tofu:       + subnet_id                            = "subnet-123456789"
05:19:49.540 STDOUT tofu:       + tags                                 = {
05:19:49.540 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
05:19:49.540 STDOUT tofu:         }
05:19:49.540 STDOUT tofu:       + tags_all                             = {
05:19:49.540 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
05:19:49.540 STDOUT tofu:         }
05:19:49.540 STDOUT tofu:       + tenancy                              = (known after apply)
05:19:49.540 STDOUT tofu:       + user_data_base64                     = (known after apply)
05:19:49.540 STDOUT tofu:       + user_data_replace_on_change          = false
05:19:49.540 STDOUT tofu:       + vpc_security_group_ids               = (known after apply)
05:19:49.540 STDOUT tofu:       + capacity_reservation_specification (known after apply)
05:19:49.540 STDOUT tofu:       + cpu_options (known after apply)
05:19:49.540 STDOUT tofu:       + ebs_block_device (known after apply)
05:19:49.541 STDOUT tofu:       + enclave_options (known after apply)
05:19:49.541 STDOUT tofu:       + ephemeral_block_device (known after apply)
05:19:49.541 STDOUT tofu:       + instance_market_options (known after apply)
05:19:49.541 STDOUT tofu:       + maintenance_options (known after apply)
05:19:49.541 STDOUT tofu:       + metadata_options (known after apply)
05:19:49.541 STDOUT tofu:       + network_interface (known after apply)
05:19:49.541 STDOUT tofu:       + primary_network_interface (known after apply)
05:19:49.541 STDOUT tofu:       + private_dns_name_options (known after apply)
05:19:49.541 STDOUT tofu:       + root_block_device (known after apply)
05:19:49.541 STDOUT tofu:     }
05:19:49.541 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:19:49.541 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.testdragon.dev/lock?id=pjg3335%252Fatlantis-test%252Fec2%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d ec2
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```